backend/app/Controllers/ApiDespacho.php

SELECT *
FROM `cliente`
---
    public function index()
    {
        $model = new ClienteModel();
        $data = $model->findAll();

INSERT INTO `cliente` (`nombre`, `apellido`, `email`, `telefono`) VALUES ('Jack', 'Sparrow', 'pajaro@gmail.com', '8976-8754')
---
    public function nuevo()
    {
        $model = new ClienteModel();
        $datos = $this->request->getJSON();
        $data = [
            'nombre' => $datos->nombre,
            'apellido' => $datos->apellido,
            'email' => $datos->email,
            'telefono' => $datos->telefono,
        ];

        $model->insert($data);

SELECT *
FROM `abogado`
---
    public function abogados()
    {
        $model = new AbogadoModel();
        $data = $model->findAll();

INSERT INTO `asunto_abogado` (`id_asunto`, `id_abogado`, `rol`, `fecha_asignacion`) VALUES (1, 2, 'Abogado Principal', '2025-12-27')
---
            // Usar consulta directa para insertar
            $db = db_connect('despachoDB');
            try {
                $result = $db->table('asunto_abogado')->insert([
                    'id_asunto' => $datos->idasunto,
                    'id_abogado' => $datos->idabogado,
                    'rol' => $datos->rol,
                    'fecha_asignacion' => $datos->fechassignacion
                ]);